{"format": "graph-model", "generatedBy": "2.3.0", "convertedBy": "TensorFlow.js Converter v2.4.0", "userDefinedMetadata": {"signature": {"inputs": {"input_1:0": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "32"}, {"size": "32"}, {"size": "3"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}}}, "modelTopology": {"node": [{"name": "input_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "32"}, {"size": "32"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/classifier/StatefulPartitionedCall/dropout/dropout/Const", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/classifier/StatefulPartitionedCall/input/_15", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/classifier/StatefulPartitionedCall/input/_16", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/classifier/StatefulPartitionedCall/input/_17", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/classifier/StatefulPartitionedCall/input/_18", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/classifier/StatefulPartitionedCall/input/_23", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/classifier/StatefulPartitionedCall/input/_19", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}}}, {"name": "Func/StatefulPartitionedCall/classifier/StatefulPartitionedCall/input/_20", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/classifier/StatefulPartitionedCall/input/_24", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/classifier/StatefulPartitionedCall/global_average_pooling2d/Mean/reduction_indices", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/classifier/StatefulPartitionedCall/input/_21", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/classifier/StatefulPartitionedCall/input/_22", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/classifier/StatefulPartitionedCall/dropout/dropout/GreaterEqual/y", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/classifier/StatefulPartitionedCall/conv2d/Relu", "op": "_FusedConv2D", "input": ["input_1", "Func/StatefulPartitionedCall/classifier/StatefulPartitionedCall/input/_15", "Func/StatefulPartitionedCall/classifier/StatefulPartitionedCall/input/_16"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/classifier/StatefulPartitionedCall/conv2d_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/classifier/StatefulPartitionedCall/conv2d/Relu", "Func/StatefulPartitionedCall/classifier/StatefulPartitionedCall/input/_17", "Func/StatefulPartitionedCall/classifier/StatefulPartitionedCall/input/_18"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/classifier/StatefulPartitionedCall/conv2d_2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/classifier/StatefulPartitionedCall/conv2d_1/Relu", "Func/StatefulPartitionedCall/classifier/StatefulPartitionedCall/input/_19", "Func/StatefulPartitionedCall/classifier/StatefulPartitionedCall/input/_20"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/classifier/StatefulPartitionedCall/global_average_pooling2d/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/classifier/StatefulPartitionedCall/conv2d_2/Relu", "StatefulPartitionedCall/classifier/StatefulPartitionedCall/global_average_pooling2d/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/classifier/StatefulPartitionedCall/dense/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/classifier/StatefulPartitionedCall/global_average_pooling2d/Mean", "Func/StatefulPartitionedCall/classifier/StatefulPartitionedCall/input/_21", "Func/StatefulPartitionedCall/classifier/StatefulPartitionedCall/input/_22"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/classifier/StatefulPartitionedCall/dropout/dropout/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/classifier/StatefulPartitionedCall/dropout/dropout/Const", "StatefulPartitionedCall/classifier/StatefulPartitionedCall/dense/Relu"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/classifier/StatefulPartitionedCall/dropout/dropout/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/classifier/StatefulPartitionedCall/dense/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/classifier/StatefulPartitionedCall/dropout/dropout/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["StatefulPartitionedCall/classifier/StatefulPartitionedCall/dropout/dropout/Shape"], "attr": {"dtype": {"type": "DT_FLOAT"}, "seed2": {"i": "0"}, "seed": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/classifier/StatefulPartitionedCall/dropout/dropout/GreaterEqual", "op": "GreaterEqual", "input": ["StatefulPartitionedCall/classifier/StatefulPartitionedCall/dropout/dropout/random_uniform/RandomUniform", "StatefulPartitionedCall/classifier/StatefulPartitionedCall/dropout/dropout/GreaterEqual/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/classifier/StatefulPartitionedCall/dropout/dropout/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/classifier/StatefulPartitionedCall/dropout/dropout/GreaterEqual"], "attr": {"SrcT": {"type": "DT_BOOL"}, "Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/classifier/StatefulPartitionedCall/dropout/dropout/Mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/classifier/StatefulPartitionedCall/dropout/dropout/Mul", "StatefulPartitionedCall/classifier/StatefulPartitionedCall/dropout/dropout/Cast"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/classifier/StatefulPartitionedCall/dense_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/classifier/StatefulPartitionedCall/dropout/dropout/Mul_1", "Func/StatefulPartitionedCall/classifier/StatefulPartitionedCall/input/_23", "Func/StatefulPartitionedCall/classifier/StatefulPartitionedCall/input/_24"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/classifier/StatefulPartitionedCall/dense_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/classifier/StatefulPartitionedCall/dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/classifier/StatefulPartitionedCall/dense_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 440}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/classifier/StatefulPartitionedCall/dropout/dropout/Const", "shape": [], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/classifier/StatefulPartitionedCall/input/_15", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/classifier/StatefulPartitionedCall/input/_16", "shape": [32], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/classifier/StatefulPartitionedCall/input/_17", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/classifier/StatefulPartitionedCall/input/_18", "shape": [64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/classifier/StatefulPartitionedCall/input/_23", "shape": [512, 10], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/classifier/StatefulPartitionedCall/input/_19", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/classifier/StatefulPartitionedCall/input/_20", "shape": [128], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/classifier/StatefulPartitionedCall/input/_24", "shape": [10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/classifier/StatefulPartitionedCall/global_average_pooling2d/Mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/classifier/StatefulPartitionedCall/input/_21", "shape": [128, 512], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/classifier/StatefulPartitionedCall/input/_22", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/classifier/StatefulPartitionedCall/dropout/dropout/GreaterEqual/y", "shape": [], "dtype": "float32"}]}]}